## Text file

In [1]:
getwd()

[1] "/Users/tranhoangbach/Google Drive/LDS7_K267_ONLINE_TranHoangBach/BaiGiang_BaiTap"

In [5]:
content = readLines('Du_lieu/bai_tho.txt', encoding='UTF-8')
print(content)

[1] "Mùa xuân là Tết trồng cây"
[2] "Làm cho đất nước càng ngày càng xuân"
[3] ""

In [6]:
content = readLines('Du_lieu/license.txt')
print(content)

[1] "These data files are derived by splitting up the data set downloaded from:"
[2] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[3] "under the Open Government License - Ontario:"
[4] "https://www.ontario.ca/page/open-government-licence-ontario"

In [7]:
length(content)

[1] 4

In [9]:
nchar(content)

[1] 74 60 44 59

In [10]:
file.size('Du_lieu/license.txt')

[1] 242

In [13]:
content_by_word = scan('Du_lieu/license.txt', '')
content_by_word

 [1] "These"
 [2] "data"
 [3] "files"
 [4] "are"
 [5] "derived"
 [6] "by"
 [7] "splitting"
 [8] "up"
 [9] "the"
[10] "data"
[11] "set"
[12] "downloaded"
[13] "from:"
[14] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[15] "under"
[16] "the"
[17] "Open"
[18] "Government"
[19] "License"
[20] "-"
[21] "Ontario:"
[22] "https://www.ontario.ca/page/open-government-licence-ontario"

In [14]:
df = read.table('Du_lieu/Table0.txt')
df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

In [15]:
class(df)

[1] "data.frame"

In [16]:
typeof(df)

[1] "list"

In [19]:
content_new = 'Hello and welcome'
file_name = file(description='Du_lieu/text.txt', open='a', encoding='UTF-8')
write(content_new, file=file_name)
content2 = readLines('Du_lieu/text.txt')
print(content2)

[1] "Hello and welcome" "Hello and welcome" "Hello and welcome"
[4] "Hello and welcome"

In [22]:
write.table(df, file='Du_lieu/table0_new.txt', sep='\t')

In [23]:
content3 = readLines('Du_lieu/table0_new.txt')
content3

[1] "\"V1\"\t\"V2\"\t\"V3\"\t\"V4\"\t\"V5\""
[2] "\"1\"\t\"Alex\"\t25\t177\t57\t\"F\""
[3] "\"2\"\t\"Lilly\"\t31\t163\t69\t\"F\""
[4] "\"3\"\t\"Mark\"\t23\t190\t83\t\"M\""
[5] "\"4\"\t\"Oliver\"\t52\t179\t75\t\"M\""
[6] "\"5\"\t\"Martha\"\t76\t163\t70\t\"F\""
[7] "\"6\"\t\"Lucas\"\t49\t183\t83\t\"M\""
[8] "\"7\"\t\"Caroline\"\t26\t164\t53\t\"F\""

## CSV file

In [1]:
data = read.csv('Du_lieu/emp.csv')
data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [2]:
class(data)

[1] "data.frame"

In [3]:
is.data.frame(data)

[1] TRUE

In [4]:
ncol(data)

[1] 5

In [5]:
nrow(data)

[1] 8

In [7]:
dim(data)

[1] 8 5

In [8]:
print(paste('Max salary:', max(data$salary)))
print(paste('Mean salary:', mean(data$salary)))
print('People have max salary')
print(subset(data, salary == max(data$salary)))

[1] "Max salary: 843.25"
[1] "Mean salary: 656.88125"
[1] "People have max salary"
  id name salary start_date    dept
5 NA Gary 843.25 2015-03-27 Finance

In [10]:
it_emps = subset(data, dept == 'IT')
write.csv(it_emps, 'Du_lieu/it_emps_new.csv', row.names=FALSE)
new_data = read.csv('Du_lieu/it_emps_new.csv')
new_data

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
2 3  Michelle 611.0  2014-11-15 IT
3 6  Nina     578.0  2013-05-21 IT

## Excel file

In [11]:
install.packages('xlsx')

also installing the dependencies ‘rJava’, ‘xlsxjars’

The downloaded binary packages are in
	/var/folders/09/wkf60t9d5p749571dbkjv86h0000gn/T//Rtmp0rVABf/downloaded_packages

In [12]:
library(xlsx)

In [14]:
data = read.xlsx('Du_lieu/emp_data.xlsx', sheetIndex=1)
data

  id name     salary start_date dept
1 1  Rick     623.30 2012-01-01 IT
2 2  Dan      515.20 2013-09-23 Operations
3 3  Michelle 611.00 2014-11-15 IT
4 4  Ryan     729.00 2014-05-11 HR
5    Gary     843.25 2015-03-27 Finance
6 6  Nina     578.00 2013-05-21 IT
7 7  Simon    632.80 2013-07-30 Operations
8 8  Guru     722.50 2014-06-17 Finance

In [15]:
data = read.xlsx('Du_lieu/emp_data.xlsx', sheetName='city')
data

  name     city
1 Rick     Seattle
2 Dan      Tampa
3 Michelle Chicago
4 Ryan     Seattle
5 Gary     Houston
6 Nina     Boston
7 Simon    Mumbai
8 Guru     Dallas

In [16]:
write.xlsx(data, file = 'Du_lieu/emp_data_city.xlsx', sheetName='Sheet1')
new_data = read.xlsx('Du_lieu/emp_data_city.xlsx', sheetName='Sheet1')
new_data

  NA. name     city
1 1   Rick     Seattle
2 2   Dan      Tampa
3 3   Michelle Chicago
4 4   Ryan     Seattle
5 5   Gary     Houston
6 6   Nina     Boston
7 7   Simon    Mumbai
8 8   Guru     Dallas